Terraform Plan:

```

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # grafana_folder.test_folder1 will be created
  + resource "grafana_folder" "test_folder1" {
      + id                           = (known after apply)
      + prevent_destroy_if_not_empty = false
      + title                        = "Test Folder 1"
      + uid                          = (known after apply)
      + url                          = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
Releasing state lock. This may take a few moments...
```

Plan saved to GH artifacts.